<?php include('comtop.php'); ?>
<?php include('header.php'); ?>

<div class="bg_form">
     <div class="container">
          <div class="row">
               <div class="col-12 p-5">
                    <h2>แบบฟอร์มการสมัครงาน</h2>
               </div>
          </div>
     </div>
</div>
<div class="container">
     <div class="row">
          <div class="col-12">
               <nav aria-label="navigation">
                         <ol class="navigation">
                              <li class="breadcrumb-item"><a href="index.php">หน้าหลัก</a></li>
                              <li class="breadcrumb-item active" aria-current="page">ประกาศรับสมัครงาน</li>
                         </ol>
               </nav>
               <hr>
          </div>
     </div>
     <div class="row">
          <div class="col-12">
              <h3>กรอกเลขบัตรประจำตัวประชาชนของท่าน</h3>
          </div>
     </div>
     <div class="row box_form"> 
               <div class="col-12 col-md-8">
                    <form action="">    
                          <input type="text" class="form-control  mb-2" id="PER_IDCARD" maxlength="13" placeholder="xxx-xx-xx-xxx-xxxx" aria-describedby="PER_IDCARD">
                    </form> 
               </div>
               <div class="col-12 col-md-4">
                    <button type="button"  class="btn detail_button  text-center col-12 mb-2" data-toggle="modal" data-target="#correct_information">สมัครงาน</button>  
               </div>
     </div>
</div>


<!-- Modal กรอกข้อมูลถูก  -->
<div class="modal fade" id="correct_information" tabindex="-1" aria-labelledby="correct_information" aria-hidden="true">
  <div class="modal-dialog">
    <div class="modal-content">
      <div class="modal-header">
        <button type="button" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body">
          <div class="row">
               <div class="col-12 text-center">
                      
                     <i class="fa-solid fa-square-check icon"></i>
                     <p> กรุณากรอกข้อมูลถูกต้อง </p>
               </div>
               <div class="col-12 text-center">
                     <button type="button" class="btn btn-danger" data-dismiss="modal">ตกลง</button>      
               </div>   
          </div>
      </div>
    </div>
  </div>
</div>

<!-- Modal กรอกข้อมูลผิด  -->
<div class="modal fade" id="data_error" tabindex="-1" aria-labelledby="data_error" aria-hidden="true">
  <div class="modal-dialog">
    <div class="modal-content">
      <div class="modal-header">
        <button type="button" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body">
          <div class="row">
               <div class="col-12 text-center">
                      <i class="fa-solid fa-square-xmark icon"></i>
                     <!-- <i class="fa-solid fa-square-check icon_check"></i> -->
                     <p> กรุณากรอกข้อมูลให้ถูกต้อง </p>
               </div>
               <div class="col-12 text-center">
                     <button type="button" class="btn btn-danger" data-dismiss="modal">ตกลง</button>      
               </div>   
          </div>
      </div>
    </div>
  </div>
</div>



<!-- Modal -->
<div class="modal fade" id="announce" tabindex="-1" role="dialog" aria-labelledby="announce" aria-hidden="true">
  <div class="modal-dialog modal-xl" role="document">
    <div class="modal-content">
      <div class="modal-header">
        <h5 class="modal-title" id="announce">นโยบายคุ้มครองข้อมูลส่วนบุคคลการรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทย</h5>
        <button type="button" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body">
      <p>  การรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทย ตระหนักและให้ความสำคัญในการคุ้มครองข้อมูลส่วนบุคคลของผู้มาติดต่อและใช้บริการของ รฟม. 
      จึงเป็นการสมควรกำหนดนโยบายการคุ้มครองข้อมูลส่วนบุคคล เพื่อแจ้งให้ทราบถึงการเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคล ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 </p>
        <b> ข้อ 1 หลักการสำคัญในการคุ้มครองข้อมูลส่วนบุคคล</b>
        <p>รฟม. จะเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคล โดยอยู่บนพื้นฐานหลักการสำคัญในการคุ้มครองข้อมูลส่วนบุคคล ดังนี้</p>
          <ol>
            <li>
            เก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลเป็นไปโดยชอบด้วยกฎหมาย เป็นธรรม และมีความโปร่งใส ต่อเจ้าของข้อมูลส่วนบุคคล (Lawfulness, Fairness and Transparency)
            </li>
            <li>เก็บรวบรวมข้อมูลส่วนบุคคลด้วยวิธีการที่ชอบด้วยกฎหมาย และจัดเก็บข้อมูลเท่าที่จำเป็นตามวัตถุประสงค์ในการดำเนินงาน และตามที่กฎหมายกำหนดเท่านั้น (Purpose Limitation) โดยจะต้องได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลก่อนหรือในขณะเก็บรวบรวมข้อมูลส่วนบุคคล 
              เว้นแต่เป็นกรณีที่กฎหมายกำหนดให้สามารถประมวลผลข้อมูลส่วนบุคคลได้โดยไม่ต้องได้รับความยินยอม</li>
              <li> เก็บรวบรวมข้อมูลส่วนบุคคลเท่าที่จำเป็นตามวัตถุประสงค์อันชอบด้วยกฎหมาย (Data Minimization)</li>
              <li>ข้อมูลส่วนบุคคลควรมีความถูกต้องและเป็นปัจจุบัน โดยจะต้องมีการดำเนินการเพื่อให้แน่ใจว่าข้อมูลส่วนบุคคลที่ไม่ถูกต้องจะได้รับการปรับปรุงแก้ไข (Accuracy)</li>
              <li>ประมวลผลข้อมูลส่วนบุคคลตามระยะเวลาเท่าที่จำเป็นต่อการประมวลผลข้อมูลส่วนบุคคล (Storage Limitation) เว้นแต่กรณีมีกฎหมายกำหนดไว้ต้องจัดเก็บข้อมูลส่วนบุคคลไว้นานกว่าระยะเวลาเท่าที่จำเป็นดังกล่าว</li>
              <li>การประมวลผลข้อมูลส่วนบุคคลต้องมีมาตรการในการรักษาความมั่นคงปลอดภัยที่เหมาะสม รวมถึงมีการป้องกันการประมวลผลข้อมูลส่วนบุคคลโดยไม่มีสิทธิหรือโดยไม่ชอบด้วยกฎหมายและป้องกันการสูญหายโดยอุบัติเหตุ การถูกทำลาย หรือถูกทำให้เสียหาย (Integrity and Confidentiality)</li>
          </ol>
          <b>  ข้อ 2 ขอบเขตการบังคับใช้</b>
          <p>
          นโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ มีขอบเขตการบังคับใช้ครอบคลุมการประมวลผลข้อมูลส่วนบุคคลที่อยู่ในความครอบครองหรือควบคุมดูแลของ รฟม.
          </p>
          <p>สำหรับข้อมูลส่วนบุคคลที่ได้เก็บรวบรวมไว้ก่อนวันที่พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ใช้บังคับ รฟม. จะเก็บรวบรวมและใช้ข้อมูลส่วนบุคคลนั้นต่อไปตามวัตถุประสงค์เดิม</p>
          <b> ข้อ 3 หลักการสำคัญในการประมวลผลข้อมูลส่วนบุคคล </b>
          <p> รฟม. จะประมวลผลข้อมูลส่วนบุคคลโดยปฏิบัติตามหลักการสำคัญในการประมวลผลข้อมูลส่วนบุคคล ดังนี้</p>
          <ol>
            <li>
            ต้องแจ้งรายละเอียดการประมวลผลข้อมูลส่วนบุคคลให้เจ้าของข้อมูลส่วนบุคคลทราบก่อนหรือในขณะเก็บรวบรวมข้อมูลส่วนบุคคล
            </li>
            <li>
            ต้องได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลก่อนการประมวลผลข้อมูลส่วนบุคคล เว้นแต่กรณีดังต่อไปนี้ สามารถประมวลผลข้อมูลส่วนบุคคลได้โดยไม่ต้องได้รับความยินยอม
              <ul>
                <li>
                (ก) เพื่อให้บรรลุวัตถุประสงค์ที่เกี่ยวข้องกับการจัดทำเอกสารประวัติศาสตร์หรือจดหมายเหตุเพื่อประโยชน์สาธารณะ หรือที่เกี่ยวข้องกับการศึกษาวิจัย หรือสถิติ
                </li>
                <li>
                 (ข) เพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของบุคคล
                </li>
                <li>
                  (ค) เพื่อปฏิบัติตามกฎหมาย  
                </li>
                <li>
                (ง) เป็นการจำเป็นเพื่อการปฏิบัติตามสัญญาซึ่งเจ้าของข้อมูลส่วนบุคคลเป็นคู่สัญญา หรือเพื่อใช้ในการดำเนินการตามคำขอของเจ้าของข้อมูลส่วนบุคคลก่อนเข้าทำสัญญา
                </li>
                <li>
                (จ) เป็นการจำเป็นเพื่อการปฏิบัติหน้าที่ในการดำเนินภารกิจเพื่อประโยชน์สาธารณะของผู้ควบคุมข้อมูลส่วนบุคคล หรือปฏิบัติหน้าที่ในการใช้อำนาจรัฐที่ได้มอบให้แก่ผู้ควบคุมข้อมูลส่วนบุคคล
                </li>
                <li>
                 (ฉ) เป็นการจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมายของผู้ควบคุมข้อมูลส่วนบุคคล หรือบุคคล หรือนิติบุคคลอื่นที่ไม่ใช่ผู้ควบคุมข้อมูลส่วนบุคคล เว้นแต่ประโยชน์ดังกล่าวมีความสำคัญน้อยกว่าสิทธิขั้นพื้นฐานในข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล 
                </li>
              </ul>
            </li>
            <li>
            ไม่เก็บรวบรวมข้อมูลส่วนบุคคลที่มีความอ่อนไหว รวมถึงการเก็บรวบรวมข้อมูลส่วนบุคคลของผู้เยาว์ คนไร้ความสามารถ หรือคนเสมือนไร้ความสามารถ เว้นแต่ได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลหรือผู้มีอำนาจกระทำแทนเจ้าของข้อมูลส่วนบุคคลโดยชัดแจ้ง หรือได้รับยกเว้นตามที่กฎหมายกำหนด
            </li>
            <li>
            ไม่เปิดเผยข้อมูลส่วนบุคคลที่มีการจัดเก็บรวบรวมไว้ให้กับบุคคลอื่น เว้นแต่ได้รับความยินยอมจากเจ้าของข้อมูลโดยทำหนังสือให้ความยินยอมเปิดเผยข้อมูลส่วนบุคคลเป็นลายลักษณ์อักษร หรือกรณีตามมาตรา 80 แห่งพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 หรือตามมาตรา 24 แห่งพระราชบัญญัติข้อมูลข่าวสารของราชการ พ.ศ. 2540
            </li>
          </ol>
          <b> ข้อ 4 แนวทางในการกำกับดูแลและบริหารจัดการข้อมูลส่วนบุคคล</b>
          <p> เพื่อยึดมั่นเป็นหลักการและใช้เป็นแนวทางในการกำกับดูแลและบริหารจัดการข้อมูลส่วนบุคคลที่อยู่ในความครอบครองหรือควบคุมดูแลของ รฟม.</p>
          <ol>
            <li> บุคลากรของ รฟม. รวมถึงผู้ปฏิบัติงานให้ รฟม. ต้องปฏิบัติตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล นโยบาย ระเบียบ ข้อบังคับ คู่มือ หรือแนวปฏิบัติใด ๆ ของ รฟม. ที่เกี่ยวข้องกับการคุ้มครองข้อมูลส่วนบุคคลอย่างเคร่งครัด</li>
            <li>จัดให้มีการอบรมให้ความรู้ ส่งเสริมให้บุคลากรของ รฟม. ตระหนักถึงความสำคัญของการคุ้มครองข้อมูลส่วนบุคคล และส่งเสริมให้มีการบริหารความเสี่ยงด้านการคุ้มครองข้อมูลส่วนบุคคลในทุกระดับขององค์กร รวมถึงจัดให้มีมาตรการควบคุมภายในที่มีประสิทธิภาพ เพื่อป้องกันการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลโดยมิชอบ</li>
            <li>จัดให้มีเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล เพื่อปฏิบัติหน้าที่ในการให้คำแนะนำ คำปรึกษา ตรวจสอบการดำเนินงานที่เกี่ยวข้องกับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของ รฟม. ให้เป็นไปตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล รวมถึงทำหน้าที่ประสานงานและให้ความร่วมมือกับสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล</li>
            <li> จัดให้มีการกำหนดวิธีการ ช่องทาง และผู้รับผิดชอบในการรับเรื่องร้องเรียน คำร้อง และดำเนินการใด ๆ รองรับการใช้สิทธิของเจ้าของข้อมูลส่วนบุคคลตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล เพื่อตรวจสอบและทำให้เจ้าของข้อมูลมั่นใจได้ว่า รฟม. ได้ดำเนินการตอบสนองต่อคำร้องขอใช้สิทธิของเจ้าของข้อมูลส่วนบุคคลอย่างเหมาะสม โดยไม่ชักช้า และอยู่ภายในระยะเวลาที่กฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคลกำหนด 
              ทั้งนี้ ในกรณีที่ รฟม. ปฏิเสธคำร้องขอใช้สิทธิของเจ้าของข้อมูลส่วนบุคคล รฟม. ต้องจัดทำบันทึกรายการการปฏิเสธคำร้องขอใช้สิทธิของเจ้าของข้อมูลส่วนบุคคลดังกล่าวพร้อมระบุเหตุผลไว้ด้วย</li>
              <li>
              จัดให้มีกระบวนการจัดทำและเก็บรักษาบันทึกรายการประมวลผลข้อมูลส่วนบุคคล ตามหลักเกณฑ์และวิธีการที่กฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคลกำหนด เพื่อให้เจ้าของข้อมูลส่วนบุคคลและสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
               สามารถตรวจสอบได้ โดยต้องดำเนินการให้บันทึกรายการประมวลผลข้อมูลส่วนบุคคลดังกล่าวมีความถูกต้อง ครบถ้วน เป็นปัจจุบัน และสมบูรณ์อยู่เสมอ
              </li>
              <li>จัดให้มีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง หรือเปิดเผยข้อมูลส่วนบุคคลที่อยู่ในความครอบครองของ รฟม. โดยมิชอบ รวมถึงจัดให้มีการทบทวนและตรวจสอบมาตรการดังกล่าว</li>
              <li> จัดให้มีกระบวนการตรวจสอบการดำเนินการลบหรือทำลายข้อมูลส่วนบุคคลเมื่อพ้นกำหนดระยะเวลาการเก็บรักษา หรือเก็บข้อมูลส่วนบุคคลที่ไม่เกี่ยวข้อง หรือเกินความจำเป็นตามวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล</li>
              <li> กรณีที่มีความจำเป็นต้องใช้ผู้ประมวลผลข้อมูลส่วนบุคคล ดำเนินการเกี่ยวกับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล ตามคำสั่งหรือในนาม รฟม. นั้น รฟม. ต้องจัดให้มีสัญญาการเก็บรักษาข้อมูลไว้เป็นความลับ และ/หรือข้อตกลงระหว่างกัน
                 เพื่อควบคุมการดำเนินงานตามหน้าที่ของผู้ประมวลผลข้อมูลส่วนบุคคลให้เป็นไปตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล และป้องกันมิให้ผู้ประมวลผลข้อมูลส่วนบุคคล ใช้หรือเปิดเผยข้อมูลส่วนบุคคลโดยมิชอบหรือเกินขอบเขตที่กำหนด</li>
              <li> ทุกส่วนงานต้องให้ความร่วมมือกับเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลในการแจ้งเหตุการณ์ละเมิดข้อมูลส่วนบุคคลแก่สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล โดยไม่ชักช้าภายใน ๗๒ ชั่วโมง นับแต่ทราบเหตุ ทั้งนี้ รฟม. จะแจ้งเหตุการณ์ละเมิดให้เจ้าของข้อมู
                ลส่วนบุคคลทราบพร้อมแนวทางการเยียวยา ในกรณีที่การละเมิดนั้นมีความเสี่ยงสูงที่จะมีผลกระทบต่อสิทธิและเสรีภาพของเจ้าของข้อมูลส่วนบุคคล</li>
                <li>
                ทุกส่วนงานต้องให้ความร่วมมือกับเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลและสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล เมื่อถูกร้องขอให้ส่งเอกสารหรือข้อมูลเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล
                 รวมถึงการชี้แจงข้อเท็จจริง เพื่อสนับสนุนการตรวจสอบและการปฏิบัติงานของเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลและสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
                </li>
          </ol>
      </div>
      <div class="modal-footer">
          <div class="col-12 text-center">
                <div class="form-check">
                    <input class="form-check-input" type="checkbox" value="" id="defaultCheck1">
               <label class="form-check-label" for="defaultCheck1">
                     ข้าพเจ้าได้อ่านและยอมรับ เงื่อนไขและข้อกำหนดการคุ้มครองข้อมูลส่วนบุคคล <label style="color:red;">*</label>
               </label>
               </div>    
          </div>
          <div class="col-12 text-center">
                <button type="button" class="btn btn-success" data-dismiss="modal">ดำเนินการ</button>
                <button type="button" class="btn btn-danger"  data-dismiss="modal">กลับหน้าหลัก</button>      
          </div>   
      </div>
    </div>
  </div>
</div>



<?php include('footer.php'); ?>
<?php include('combottom.php'); ?>